[
  {
    "resume": "PROFESSIONAL SUMMARY\nData Scientist with 5 years of experience applying statistical modeling, machine learning, and data mining to solve complex business problems. Expertise in Python, R, SQL, and cloud-based analytics platforms.\n\nSKILLS\n• Programming: Python (pandas, scikit-learn, TensorFlow, PyTorch), R, SQL\n• Machine Learning: Regression, Classification, Clustering, Deep Learning, NLP\n• Tools: Jupyter, Git, Docker, AWS, Azure\n• Visualization: Tableau, PowerBI, matplotlib, seaborn\n\nEXPERIENCE\nSenior Data Scientist | TechCorp Inc. | 2022-Present\n• Led development of customer churn prediction model that improved retention by 15%\n• Implemented NLP pipeline for sentiment analysis on customer feedback\n• Mentored junior data scientists and established best practices\n\nData Scientist | DataDriven Solutions | 2020-2022\n• Built recommendation engine that increased user engagement by 22%\n• Developed time series forecasting models for inventory optimization\n\nEDUCATION\nM.S. in Data Science, Stanford University, 2020\nB.S. in Computer Science, UC Berkeley, 2018",
    "job_description": "Data Scientist\n\nAbout Us:\nTechInnovate is a leading technology company specializing in AI-driven solutions for enterprise clients.\n\nRole Overview:\nWe are seeking an experienced Data Scientist to join our analytics team. The ideal candidate will have strong skills in machine learning, statistical analysis, and programming to extract insights from complex datasets.\n\nResponsibilities:\n• Develop and implement machine learning models to solve business problems\n• Analyze large datasets to identify patterns and trends\n• Create data visualizations and reports for stakeholders\n• Collaborate with engineering teams to deploy models to production\n• Stay current with latest developments in machine learning and data science\n\nRequirements:\n• 3+ years of experience in data science or related field\n• Proficiency in Python and its data science libraries (pandas, scikit-learn, etc.)\n• Experience with deep learning frameworks (TensorFlow, PyTorch)\n• Strong understanding of statistical methods and machine learning algorithms\n• Excellent communication skills to explain complex concepts to non-technical stakeholders\n• MS or PhD in Computer Science, Statistics, or related field",
    "role": "Data Scientist",
    "experience": "Mid Level",
    "match": 1
  },
  {
    "resume": "PROFESSIONAL SUMMARY\nData Scientist with 5 years of experience applying statistical modeling, machine learning, and data mining to solve complex business problems. Expertise in Python, R, SQL, and cloud-based analytics platforms.\n\nSKILLS\n• Programming: Python (pandas, scikit-learn, TensorFlow, PyTorch), R, SQL\n• Machine Learning: Regression, Classification, Clustering, Deep Learning, NLP\n• Tools: Jupyter, Git, Docker, AWS, Azure\n• Visualization: Tableau, PowerBI, matplotlib, seaborn\n\nEXPERIENCE\nSenior Data Scientist | TechCorp Inc. | 2022-Present\n• Led development of customer churn prediction model that improved retention by 15%\n• Implemented NLP pipeline for sentiment analysis on customer feedback\n• Mentored junior data scientists and established best practices\n\nData Scientist | DataDriven Solutions | 2020-2022\n• Built recommendation engine that increased user engagement by 22%\n• Developed time series forecasting models for inventory optimization\n\nEDUCATION\nM.S. in Data Science, Stanford University, 2020\nB.S. in Computer Science, UC Berkeley, 2018",
    "job_description": "Marketing Manager\n\nAbout Us:\nGrowthBrand is an innovative consumer products company with a portfolio of premium brands.\n\nRole Overview:\nWe are looking for a creative and strategic Marketing Manager to lead our marketing initiatives and drive brand growth.\n\nResponsibilities:\n• Develop and implement comprehensive marketing strategies\n• Manage marketing budget and track ROI of campaigns\n• Oversee social media, content marketing, and email campaigns\n• Collaborate with creative teams on brand messaging and design\n• Analyze market trends and competitor activities\n\nRequirements:\n• 5+ years of experience in marketing, preferably in consumer goods\n• Proven track record of successful marketing campaigns\n• Experience with digital marketing platforms and analytics tools\n• Strong project management and team leadership skills\n• Bachelor's degree in Marketing, Business, or related field",
    "resume_role": "Data Scientist",
    "job_role": "Marketing Manager",
    "resume_experience": "Mid Level",
    "job_experience": "Senior Level",
    "match": 0
  },
  {
    "resume": "PROFESSIONAL SUMMARY\nFrontend Developer with 4 years of experience building responsive, user-friendly web applications. Passionate about creating intuitive UIs with modern JavaScript frameworks.\n\nSKILLS\n• Languages: JavaScript (ES6+), TypeScript, HTML5, CSS3, SASS\n• Frameworks: React, Vue.js, Angular\n• Tools: Webpack, Babel, Jest, Cypress, Git\n• Design: Responsive design, CSS Grid, Flexbox, Material UI\n\nEXPERIENCE\nSenior Frontend Developer | WebTech Solutions | 2023-Present\n• Led development of company's flagship SaaS product using React and TypeScript\n• Implemented state management with Redux and optimized performance\n• Collaborated with UX designers to implement responsive designs\n\nFrontend Developer | Digital Innovations | 2020-2023\n• Developed interactive web applications using Vue.js\n• Built reusable component library that reduced development time by 30%\n• Implemented automated testing with Jest and Cypress\n\nEDUCATION\nB.S. in Computer Science, University of Washington, 2020",
    "job_description": "Frontend Developer\n\nAbout Us:\nTechSolutions is a fast-growing tech company creating innovative web applications for diverse clients.\n\nRole Overview:\nWe are looking for a skilled Frontend Developer to join our engineering team and build engaging user interfaces for our web applications.\n\nResponsibilities:\n• Develop responsive web applications using modern JavaScript frameworks\n• Collaborate with designers to implement UI/UX designs\n• Write clean, maintainable, and efficient code\n• Optimize applications for maximum speed and scalability\n• Implement automated testing and ensure cross-browser compatibility\n\nRequirements:\n• 3+ years of experience in frontend development\n• Strong proficiency in JavaScript, HTML5, and CSS3\n• Experience with React, Vue.js, or Angular\n• Knowledge of responsive design principles\n• Familiarity with version control systems (Git)",
    "role": "Frontend Developer",
    "experience": "Mid Level",
    "match": 1
  },
  {
    "resume": "PROFESSIONAL SUMMARY\nRecent Computer Science graduate with internship experience in software development. Eager to apply my knowledge of Python, Java, and web technologies in a professional setting.\n\nSKILLS\n• Programming Languages: Python, Java, JavaScript\n• Web Development: HTML, CSS, React basics\n• Databases: SQL, MongoDB basics\n• Tools: Git, VS Code, Linux\n\nEXPERIENCE\nSoftware Development Intern | TechStart Inc. | Summer 2024\n• Assisted in developing features for company's web application using React\n• Fixed bugs and improved UI components\n• Participated in code reviews and agile development processes\n\nIT Support Intern | University IT Department | 2023-2024\n• Provided technical support to students and faculty\n• Maintained and updated department website\n• Assisted with network troubleshooting\n\nEDUCATION\nB.S. in Computer Science, State University, 2024\n• GPA: 3.8/4.0\n• Relevant Coursework: Data Structures, Algorithms, Database Systems, Web Development",
    "job_description": "Senior Software Engineer\n\nAbout Us:\nInnovateTech is a leading software company developing cutting-edge solutions for enterprise clients.\n\nRole Overview:\nWe are seeking a Senior Software Engineer to lead development efforts and mentor junior team members.\n\nResponsibilities:\n• Architect and implement complex software solutions\n• Lead technical design discussions and code reviews\n• Mentor junior developers and provide technical guidance\n• Collaborate with product managers to define requirements\n• Ensure code quality, performance, and reliability\n\nRequirements:\n• 8+ years of professional software development experience\n• Expert knowledge of multiple programming languages (Java, Python, etc.)\n• Experience with microservices architecture and distributed systems\n• Strong understanding of software design patterns and best practices\n• History of leading development teams and mentoring engineers",
    "resume_role": "Junior Developer",
    "job_role": "Senior Software Engineer",
    "resume_experience": "Entry Level",
    "job_experience": "Senior Level",
    "match": 0
  }
]
